Tekla Open API Reference for Tekla Structures 2025
View.ViewShorteningAttributes Constructor (Boolean, Boolean, Double, Double, View.ShorteningCutPartType)
 Creates a new view shortening attributes instance with the given parameters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewShorteningAttributes(
	bool CutParts,
	bool CutSkewParts,
	double MinimumLength,
	double Offset,
	View.ShorteningCutPartType CutPartType = View.ShorteningCutPartType.BothDirections
)
Public Sub New (
	CutParts As Boolean,
	CutSkewParts As Boolean,
	MinimumLength As Double,
	Offset As Double,
	Optional CutPartType As View.ShorteningCutPartType = View.ShorteningCutPartType.BothDirections
)
Parameters
CutParts
Type: System.Boolean
A value indicating whether cut parts are enabled.
CutSkewParts
Type: System.Boolean
A value indicating whether cut skewed parts are enabled.
MinimumLength
Type: System.Double
The minimum cut part length.
Offset
Type: System.Double
The space between the cut parts.
CutPartType (Optional)
Type: Tekla.Structures.Drawing.View.ShorteningCutPartType
The optional cut part direction type.
See Also
Reference
View.ViewShorteningAttributes Class
View.ViewShorteningAttributes Overload
Tekla.Structures.Drawing Namespace